app/controllers/articles_controller.rb

    def create
        # render plain: params[:article].inspect

        # @article = Article.new(params[:article])
        @article = Article.new(article_params)

        # Added validation form
        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["text", ""], ["created_at", "2019-03-29 13:22:36.004780"], ["updated_at", "2019-03-29 13:22:36.004780"]]